{
    "format": "layers-model",
    "generatedBy": "keras v2.15.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
      "keras_version": "2.15.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Functional",
        "config": {
          "name": "functional_2",
          "trainable": true,
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [null, 10],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_layer_2"
              },
              "name": "input_layer_2",
              "inbound_nodes": []
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_7",
                "trainable": true,
                "dtype": "float32",
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "dense_7",
              "inbound_nodes": [[["input_layer_2", 0, 0, {}]]]
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_3",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.3,
                "noise_shape": null,
                "seed": null
              },
              "name": "dropout_3",
              "inbound_nodes": [[["dense_7", 0, 0, {}]]]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_8",
                "trainable": true,
                "dtype": "float32",
                "units": 32,
                "activation": "elu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "dense_8",
              "inbound_nodes": [[["dropout_3", 0, 0, {}]]]
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_4",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.2,
                "noise_shape": null,
                "seed": null
              },
              "name": "dropout_4",
              "inbound_nodes": [[["dense_8", 0, 0, {}]]]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_9",
                "trainable": true,
                "dtype": "float32",
                "units": 3,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "dense_9",
              "inbound_nodes": [[["dropout_4", 0, 0, {}]]]
            }
          ],
          "input_layers": [["input_layer_2", 0, 0]],
          "output_layers": [["dense_9", 0, 0]]
        }
      },
      "training_config": {
        "loss": "categorical_crossentropy",
        "metrics": [[
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]],
        "weighted_metrics": null,
        "loss_weights": null,
        "optimizer_config": {
          "class_name": "Adam",
          "config": {
            "name": "Adam",
            "learning_rate": 0.0001250000059371814,
            "beta_1": 0.9,
            "beta_2": 0.999,
            "epsilon": 1e-07,
            "amsgrad": false,
            "weight_decay": null,
            "clipnorm": null,
            "global_clipnorm": null,
            "clipvalue": null,
            "use_ema": false,
            "ema_momentum": 0.99,
            "ema_overwrite_frequency": null
          }
        }
      }
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          {"name": "dense_7/kernel", "shape": [10, 64], "dtype": "float32"},
          {"name": "dense_7/bias", "shape": [64], "dtype": "float32"},
          {"name": "dense_8/kernel", "shape": [64, 32], "dtype": "float32"},
          {"name": "dense_8/bias", "shape": [32], "dtype": "float32"},
          {"name": "dense_9/kernel", "shape": [32, 3], "dtype": "float32"},
          {"name": "dense_9/bias", "shape": [3], "dtype": "float32"}
        ]
      }
    ]
  }